Update 2026-03-11-choosing-what-to-automate.md
